package main

import(
	"github.com/gin-gonic/gin"
)
func main()  {
	r := gin.Default()

	r.GET("/", func(context *gin.Context) {
		response := "" +
		"千禧年夏末出生 \n" +
		"从小在武汉长大，一直在武汉读书，目前在武汉工作 \n" +
		"只对武昌比较熟 \n" +
		"\n" + 
		"大三在武汉一家云计算公司实习半年后端开发，22年毕业后，在北京一家云计算公司工作半年后，回到其武汉分公司工作至今 \n" +
		"\n" +
		"空闲时持续性接兼职，一瓶矿泉水不嫌少，一个小目标不嫌多，干什么全听老板吩咐 \n" +
		"\n" +
		"头条号：不会前端的笨蛋 \n" +
		"http://139.159.181.195:8080/ 文稿关键词替换 \n" +
		"http://139.159.181.195:8081/ 时间商店 \n" +
		"http://139.159.181.195:8082/ 口令交流网 \n"
		context.String(200, response)
	})

	r.Run(":80")
}